// 冒牌排序

arr = [1,9,3,7]
// 第一次大循环 将最大值放最后

// 拿出一个值和后面一个值做比较，如果这个值比后面一个值大,
// 就和后面的这个值调换位置
// i = 0; 拿出1; 1 > 9 false; [1,9,3,7]; i++
// i = 1; 拿出9; 9 > 3 true; [1,3,9,7]; i++
// i = 2; 拿出9；9 > 7 true; [1,3,7,9]; i++
// i = 3; 拿到9；后面没有需要比较的值，所以不需要再将9拿出来比较




// 第二次大循环，将倒数第二大值放倒数第二后


arr = [3,9,1,7]  // [3, 1, 7, 9]
// j = 1
// i = 0; 拿到3; 3 > 1 true; [1,3,7,9]; i++
// i = 1; 拿到3; 3 > 7 false; [1,3,7,9]; i++
// i = 2; 拿到7; 7 > 9 false; [1,3,7,9]; i++

// console.log(arr)
// |----|----|
// arr.length - 1 - j 后面都是排好序的
// arr.length - 1 - j 前面都是未排好序的
// j代表排好序的值得数量
// 大循环就是为了改变j的值，告诉小循环，那些事排好序的值

for (var j = 0; j < arr.length - 1; j++) {
    for (var i = 0; i < arr.length - 1 - j; i++) {
        if(arr[i] > arr[i+1]) {
            var temp = arr[i]
            arr[i] = arr[i + 1]
            arr[i + 1] = temp
            // [arr[i], arr[i+1]] = [arr[i+1],arr[i]]
        }
    }
}
console.log(arr)